

#include "gpio.h"
//#include "uart.h"
#include "main.h"
#include "intrins.h"
#include "STC15Wxx.h"


//------------------------------------------------
//- 外部端口初始化
//------------------------------------------------
void init_gpio()
{	
	P1M1 = 0x00; // # 0000 0000 
	P1M0 = 0xFF; // # 1111 1111
	
  P3M1 = 0x01; // # 0000 0000   //  P32 P33推挽输出 
  P3M0 = 0x0D; // # 0000 1100	  //

	P5M1 = 0x00;  //# 0000 0000   // P54-pp P55-pp
	P5M0 = 0x30;  //# 0011 0000

	MC_1 = 0;
	MC_2 = 2;
	LED_R = 0;
	LED_G = 0;
}


//--------------------------------------
//- 电池电量测量  A点电压 3.2V  B点电压3.0V
//- 返回新旧电池
//-  输入量 1 高压阈值比较  0 低压阈值比较

//bit battery_test(bit cmp_bit)
//{
//	uint16_t delay_a = 65535;
//	
//	if(cmp_bit)
//	    CMP_A = 1;    //断开第二比较电压   取消外部MOSFET 直接端口OC门输出
//	else CMP_A = 0;   //开启第二个阈值电压点
//	
//  PWM_value = PWM_MAX;  
//	while(delay_a --);  //带载测试    
//	
//	if(get_CMP()==0) 	  //这样的检测方式，主要是观察新电池在正常工作时，工作多少时间能到达低于A点的行为，如
//	{										//如果时间太长空耗点，影响前7个小时，如果设置的太短担心电池批量电压不均衡，导致误动作，更换电池后不开启高亮
//		 PWM_value = 0;  //OFF
//		return 1; //新电池
//	}		
//	else 
//	{
//		return 0; //旧电池
//	}
//}


